Proyectos Trabajos/Broxel/Core-Process/Documentacion/Archivos Respaldo/UpdateAccountCustomerRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ps="http://schemas.datacontract.org/2004/07/PS.IssuerCustomer.ClientWS.Contract.DataTypes" xmlns:ps1="http://schemas.datacontract.org/2004/07/PS.IssuerCustomer.ClientWS.Contract.DataTypes.UpdateAccountCustomer" xmlns:ps2="http://schemas.datacontract.org/2004/07/PS.IssuerCustomer.ClientWS.Contract.DataTypes.AddAccountDTO">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:UpdateAccountCustomer>
         <!--Optional:-->
         <tem:accountFilter>
            <!--Optional:-->
            <ps:GeneralAccountNumber>39840</ps:GeneralAccountNumber>
            <!--Optional:-->
            <ps:IssuerCode>105</ps:IssuerCode>
         </tem:accountFilter>
         <!--Optional:-->
         <tem:customer>
            <!--Optional:-->
            <ps1:Addresses>
               <!--Zero or more repetitions:-->
               <ps1:AddressDTO>
                  <!--Optional:-->
                  <ps1:AdditionalInfo>NONE</ps1:AdditionalInfo>
                  <!--Optional:-->
                  <ps1:AddressType>1</ps1:AddressType>
                  <!--Optional:-->
                  <ps1:AreaCodePhoneNumber>55</ps1:AreaCodePhoneNumber>
                  <!--Optional:-->
                  <ps1:CelNumber>5521773788</ps1:CelNumber>
                  <!--Optional:-->
                  <ps1:CityCode>866</ps1:CityCode>
                  <!--Optional:-->
                  <ps1:CountryCode>484</ps1:CountryCode>
                  <!--Optional:-->
                  <ps1:CountryCodeCelNumber>52</ps1:CountryCodeCelNumber>
                  <!--Optional:-->
                  <ps1:CountryCodePhoneNumber>52</ps1:CountryCodePhoneNumber>
                  <!--Optional:-->
                  <ps1:DoorNumber>17</ps1:DoorNumber>
                  <!--Optional:-->
                  <ps1:ExtensionPhoneNumber>12</ps1:ExtensionPhoneNumber>
                  <!--Optional:-->
                  <ps1:GeographicCode>MX-DF</ps1:GeographicCode>
                  <!--Optional:-->
                  <ps1:Neighbourhood>Los Reyes</ps1:Neighbourhood>
                  <!--Optional:-->
                  <ps1:PhoneNumber>56945765</ps1:PhoneNumber>
                  <!--Optional:-->
                  <ps1:PostalCode>09849</ps1:PostalCode>
                  <!--Optional:-->
                  <ps1:Street>Oceplopan</ps1:Street>
                  <!--Optional:-->
                  <ps1:StreetType>1</ps1:StreetType>
               </ps1:AddressDTO>
            </ps1:Addresses>
            <!--Optional:-->
            <ps1:CustomerType>1</ps1:CustomerType>
            <!--Optional:-->
            <ps1:Document>9999999999999</ps1:Document>
            <!--Optional:-->
            <ps1:DocumentTypeCode>4</ps1:DocumentTypeCode>
            <!--Optional:-->
            <ps1:FinantialRelationType>1</ps1:FinantialRelationType>
            <!--Optional:-->
            <ps1:LegalPerson>
               <!--Optional:-->
               <ps:ActivityCountry>484</ps:ActivityCountry>
               <!--Optional:-->
               <ps:ActivityScope>1</ps:ActivityScope>
               <!--Optional:-->
               <ps:AnualBillingCurrency>1</ps:AnualBillingCurrency>
               <!--Optional:-->
               <ps:AnualBillingValue>12000000.00</ps:AnualBillingValue>
               <!--Optional:-->
               <ps:BusinessEntityTypeCode>8211</ps:BusinessEntityTypeCode>
               <!--Optional:-->
               <!--<ps:CustomerProducts>
                  <ps2:ProductDTO>
                     <ps2:AffinityGroupCode>9999</ps2:AffinityGroupCode>
                     <ps2:ExternalCardNumber>?</ps2:ExternalCardNumber>
                     <ps2:ExternalDueDate>?</ps2:ExternalDueDate>
                     <ps2:ExternalTransactionBin>?</ps2:ExternalTransactionBin>
                     <ps2:ExternalTransactionMaskedPan>?</ps2:ExternalTransactionMaskedPan>
                     <ps2:HasFraudAndProtectionInsurance>?</ps2:HasFraudAndProtectionInsurance>
                     <ps2:ProductCode>?</ps2:ProductCode>
                     <ps2:ProductCreditLines>
                        <ps:CreditLineDTO>
                           <ps:CreditLineCode>BCE000</ps:CreditLineCode>
                           <ps:CreditLineValue>20</ps:CreditLineValue>
                           <ps:CreditLineValueType>F</ps:CreditLineValueType>
                        </ps:CreditLineDTO>
                     </ps2:ProductCreditLines>
                     <ps2:Urgent>false</ps2:Urgent>
                  </ps2:ProductDTO>
               </ps:CustomerProducts>
-->
               <!--Optional:-->
               <ps:EconomicGroupCode>1</ps:EconomicGroupCode>
               <!--Optional:-->
               <ps:EmbossingName>PruebasTiBroxel</ps:EmbossingName>
               <!--Optional:-->
               <ps:EmployeesNumber>100</ps:EmployeesNumber>
               <!--Optional:-->
               <ps:FantasyName>MerchantPruebasTiBroxel</ps:FantasyName>
               <!--Optional:-->
               <ps:FoundationCountry>484</ps:FoundationCountry>
               <!--Optional:-->
               <ps:FoundationDate>25051987</ps:FoundationDate>
               <!--Optional:-->
               <ps:LegalName>PruebasTiBroxel</ps:LegalName>
               <!--Optional:-->
               <ps:MerchantCategoryCode>2</ps:MerchantCategoryCode>
               <!--Optional:-->
               <ps:NetWorthCurrency>12</ps:NetWorthCurrency>
               <!--Optional:-->
               <ps:NetWorthValue>1222.00</ps:NetWorthValue>
               <!--Optional:-->
               <ps:StartActivityDate>25051987</ps:StartActivityDate>
            </ps1:LegalPerson>
            <!--Optional:-->
            <ps1:PhysicalPerson>
               <!--Optional:-->
               <ps2:AdditionalDocument>9999999999999</ps2:AdditionalDocument>
               <!--Optional:-->
               <ps2:AdditionalDocumentTypeCode>4</ps2:AdditionalDocumentTypeCode>
               <!--Optional:-->
               <ps2:BirthDate>25051987</ps2:BirthDate>
               <!--Optional:-->
               <ps2:BirthPlace></ps2:BirthPlace>
               <!--Optional:-->
               <ps2:CustomerName>PruebasTiBroxel</ps2:CustomerName>
               <!--Optional:-->
               <ps2:CustomerProducts>
                  <!--Zero or more repetitions:-->
                  <ps2:ProductDTO>
                     <!--Optional:-->
                     <ps2:AffinityGroupCode>9999</ps2:AffinityGroupCode>
                     <!--Optional:-->
                     <ps2:ExternalCardNumber></ps2:ExternalCardNumber>
                     <!--Optional:-->
                     <ps2:ExternalDueDate></ps2:ExternalDueDate>
                     <!--Optional:-->
                     <ps2:ExternalTransactionBin></ps2:ExternalTransactionBin>
                     <!--Optional:-->
                     <ps2:ExternalTransactionMaskedPan></ps2:ExternalTransactionMaskedPan>
                     <!--Optional:-->
                     <ps2:HasFraudAndProtectionInsurance>false</ps2:HasFraudAndProtectionInsurance>
                     <!--Optional:-->
                     <ps2:ProductCode>BCE000</ps2:ProductCode>
                     <!--Optional:-->
                     <ps2:ProductCreditLines>
                        <!--Zero or more repetitions:-->
                        <ps:CreditLineDTO>
                           <!--Optional:-->
                           <ps:CreditLineCode>1</ps:CreditLineCode>
                           <!--Optional:-->
                           <ps:CreditLineValue>20</ps:CreditLineValue>
                           <!--Optional:-->
                           <ps:CreditLineValueType>F</ps:CreditLineValueType>
                        </ps:CreditLineDTO>
                     </ps2:ProductCreditLines>
                     <!--Optional:-->
                     <ps2:Urgent>false</ps2:Urgent>
                  </ps2:ProductDTO>
               </ps2:CustomerProducts>
               <!--Optional:-->
               <ps2:CustomerSurname>PruebasTiBroxel</ps2:CustomerSurname>
               <!--Optional:-->
               <ps2:Email>esteban.cruz@broxel.com</ps2:Email>
               <!--Optional:-->
               <ps2:EmbossingName>EmboPruebasTiBroxel</ps2:EmbossingName>
               <!--Optional:-->
               <!--<ps2:EmploymentInfo>
                  <ps:ByContract></ps:ByContract>
                  <ps:ContractDueDate></ps:ContractDueDate>
                  <ps:Employer></ps:Employer>
                  <ps:EmployerDocument></ps:EmployerDocument>
                  <ps:EmployerDocumentTypeCode></ps:EmployerDocumentTypeCode>
                  <ps:EmploymentOccupationCode></ps:EmploymentOccupationCode>
                  <ps:EmploymentSectorCode></ps:EmploymentSectorCode>
                  <ps:HasExternalIncomes></ps:HasExternalIncomes>
                  <ps:HasOwnIncomes></ps:HasOwnIncomes>
                  <ps:IsPoliticallyExposed></ps:IsPoliticallyExposed>
                  <ps:Position></ps:Position>
                  <ps:RegistrationDate></ps:RegistrationDate>
                  <ps:TotalIncomes></ps:TotalIncomes>
               </ps2:EmploymentInfo>
-->
               <!--Optional:-->
               <ps2:ExternalCustomerId>371375125</ps2:ExternalCustomerId>
               <!--Optional:-->
               <ps2:Gender>2</ps2:Gender>
               <!--Optional:-->
               <ps2:MaritalStatus>1</ps2:MaritalStatus>
               <!--Optional:-->
               <ps2:Nationality>484</ps2:Nationality>
               <!--Optional:-->
               <ps2:NumberOfChildren>0</ps2:NumberOfChildren>
               <!--Optional:-->
               <ps2:SamePhysicalAsMainResponsible>true</ps2:SamePhysicalAsMainResponsible>
            </ps1:PhysicalPerson>
            <!--Optional:-->
            <ps1:SameAddressForMailing>true</ps1:SameAddressForMailing>
            <!--Optional:-->
            <ps1:UseParentAddress>false</ps1:UseParentAddress>
         </tem:customer>
      </tem:UpdateAccountCustomer>
   </soapenv:Body>
</soapenv:Envelope>